{
  "id": "post1",
  "title": "Introducing Sprints to Our Startup",
  "date": "2025-11-30",
  "excerpt": "How we implemented 2-week sprints, a new ticketing system, feature flagging with LaunchDarkly, and team training to improve our release process at our small startup.",
  "content": "Like many early-stage startups, our releases have been inconsistent. Sometimes tiny, sometimes massive, often months apart.\n\nThis has generally worked fine for our purposes since our development team and user base are small. However, on our last release cycle, we ran into an issue where we couldn't release many smaller features and bugs because we were waiting on one much larger feature to be fully complete. Even though many smaller improvements were ready to ship, the entire release was blocked by that one feature. This led to a 3-month development cycle, one of our longest yet. Customers were stuck with bugs and older features for months before we were able to release. It was a huge relief once the feature was completely finished and we were able to push to production.\n\n## Implementing the new system\n\nAfter this tough situation, we decided to start implementing 2-week sprints. With thought and planning around how our development team could work best, we came up with the following:\n\n- 11 days for development\n\n- 3 days for testing and fixing\n\n- 1 day for release and production monitoring\n\nIn addition to this, we've implemented a better ticketing system that breaks down features to work within these 2 week cycles. Large features are broken down into several sprints, which makes for faster release cycles.\n\nWe also implemented feature flagging with LaunchDarkly so we could allow partially completed features to be merged into the main branch and pushed to production without being released to users. This lets us ship incomplete features safely, reduce long-lived branches, avoid merge conflicts (which I hate with every bit of my soul), and test everything together in production without exposing unfinished work to users. We don't feature flag everything, but for select items that are higher risk it's beneficial.\n\n## Training the team\n\nRight now our development team is made up of 2 engineers, so training was very streamlined; however our team includes junior engineers who are early in their careers, so there was a bit of a learning curve that took place. We implemented the sprint concept in the following order:\n\n- We created a **living sprint document** that outlines how our team operates. It's updated constantly as we learn what works and what doesn't. For context, we also shared learning resources on Waterfall vs Agile.\n\n- We reintroduced and enforced **structured branching**: one branch per ticket. Previously, branches often contained multiple features and bug fixes, and sometimes changes were pushed directly to main. We formalized this and documented it clearly.\n\n- We treated the first three sprints as a testing phase, adjusting along the way. The biggest challenge was planning tickets in advance instead of discovering work mid-sprint. That shift alone improved visibility and reduced stress.\n\nOverall, it's going great so far and very worth the time and effort planning and training. We still have some hiccups - I personally write most of the tickets, and I'm struggling finding the time to do so and sometimes I give a couple tickets on day 1 of the sprint and the rest the next day (there's a lot to think about with breaking down features, prioritizing, checking bug complaints, etc), so it's a work in progress on my side. However overall, we're very happy with these fundamental changes to our release process."
}

